def extract_features(text):
    if text is None:
        return []
    else:
        result = []
        all_features = {
            "Россия": ["РФ", "Российская Федерация", "Росси"],
            "Путин": ["Путин", "Президент России", "Глава государства"],
            "Украина": ["украин", "Киевская Русь", "Киев", "Зеленск", "Верховная Рада"],
            "США": ["Соединенные Штаты Америки", "америк", "Штат", "US", "США"],
            "Европа": ["Европейский Союз", "ЕС", "Европейское сообщество", "EU"],
            "Германия": ["Германи", "Deutschland", "ФРГ", "Берлин", "Бундестаг"],
            "Китай": ["КНР", "Кита", "China", "Китайская Народная Республика", "Пекин", "кпк"],
            "Турция": ["Турецкая Республика", "Türkiye", "Анатолия", "Анкар", "Турци", "турец"],
            "Сирия": ["САР", "Syrian Arab Republic", "дамаск", "Ближний Восток", "Сири"],
            "Экономика": ["хозяйств", "экономическая сфера", "рынок", "эконом", "финанс"],
            "Политика": ["государственная деятельность", "власт", "дипломат", "полит"],
            "Общество": ["социум", "населени", "граждан", "социальная сфера"],
            "Культура": ["искусств", "культур", "наследи", "традици"],
            "Спорт": ["физическая культура", "спорт", "игр", "чемпионат"],
            "Наука": ["научная деятельность", "исследовани", "технологи", "инноваци", "наук"],
            "Технологии": ["техн", "инноваци", "ИТ", "разработк"],
            "Здравоохранение": ["мед", "здрав", "больниц", "врач", "поликлинник"],
            "Образование": ["учеб", "школ", "вуз", "образован"],
            "Москва": ["столица России", "Moscow", "мегаполис", "москв", "московск"],
            "Санкт-Петербург": ["Питер", "Северная столица", "Ленинград", "СПб", "Санкт-Петербург"],
            "Крым": ["Крым", "Crimea", "Севастополь", "Черное море"],
            "Донбасс": ["Донецкий бассейн", "Donbas", "ДНР", "ЛНР", "Донецк", "Луганск"],
            "НАТО": ["Североатлантический альянс", "NATO", "Блок НАТО", "Военный союз", "НАТО"],
            "ООН": ["Организация Объединенных Наций", "UN", "United Nations", "Генассамблея ООН", "ООН", "совбез", "совет без"],
            "Газпром": ["газовая промышленность", "Gazprom", "энергетик", "газовый гигант", "газпром"],
            "Роснефть": ["нефтяная промышленность", "Rosneft", "нефть", "ТНК", "роснефт"],
            "Сбербанк": ["сбер", "Sberbank", "финансовая организация"],
            "COVID-19": ["коронавирус", "ковид", "пандем"],
            "Выборы": ["голосовани", "избирательная кампания", "президентские выборы", "дум", "выбор"],
            "Армия": ["вооруженные силы", "военны", "солдат", "оборон", "арми", "вс рф", "всу"],
            "Госдума": ["парламент", "законодательная власть", "депутат", "ГД РФ", "госдум"],
            "Космос": ["вселенная", "астронавтика", "космонавтика", "МКС", "НАСА", "Роскосмос", "косм"],
            "Климат": ["погод", "изменение климата", "эколог", "природные условия", "климат"],
            "Цены": ["стоимост", "тариф", "рынок", "экономическая ситуация"],
            "Банки": ["финансовые учреждения", "кредит", "депозит", "банковская система", "банк"],
            "Нефть": ["углеводород", "нефтяной рынок", "бензин", "баррел", "нефт"],
            "Газ": ["топлив", "энергоресурс", "газ"],
            "Энергетика": ["электр", "ТЭК", "ресурс", "энерг"],
            "Преступность": ["криминал", "правонарушени", "мафи", "преступные группировки", "преступност"],
            "Полиция": ["правоохранительные органы", "МВД", "силовик", "стражи порядка", "полиц"],
            "МВД": ["Министерство внутренних дел", "правоохранител", "полици", "органы безопасности", "мвд"],
            "Минобороны": ["Министерство обороны", "военное ведомство", "арми", "МО РФ", "вс рф", "белоусов"],
            "ФСБ": ["Федеральная служба безопасности", "контрразведк", "силовые структуры", "спецслужб", "ФСБ"],
            "Туризм": ["путешестви", "отдых", "курорт", "турист", "туризм"],
            "Авто": ["автомобил", "транспорт", "автопром", "машин"],
            "ЖКХ": ["коммунальные услуги", "жилищно-коммунальное хозяйство", "тариф", "ремонт", "ЖКХ"],
            "Интернет": ["сеть", "всемирная паутина", "онлайн", "интернет", "соцсет", "digital"],
            "Искусственный интеллект": ["ИИ", "AI", "машинное обучение", "нейросет"]
        }
        for feature, triggers in all_features.items():
            for trigger in triggers:
                if trigger.lower() in text.lower():
                    result.append(feature)
                    break
        return result

# Подсчёт количества каждых реакций
def extract_reactions(message):
    result = {}
    if message.reactions is not None: 
        for reaction in message.reactions.reactions:
            if not reaction.emoji in result:
                result[reaction.emoji] = reaction.count
    return result